#+TITLE: Traduction française du [[https://orgmode.org/org.pdf][manuel Org]]
#+AUTHOR: Laurent Garnier

#+LANGUAGE: FR
#+OPTIONS: toc:t h:3 num:t
*** Valeurs de temps et de durées
    Si vous voulez calculer des valeurs de temps utilisez les drapeaux
    '=T=', '=t=', ou '=U=', soit dans des formules Calc ou dans des
    formules Elisp :

    | Tâche 1 |  Tâche 2 |    Total |
    |---------+----------+----------|
    |    2:12 |     1:47 | 03:59:00 |
    |    2:12 |     1:47 |    03:59 |
    | 3:02:20 | -2:07:00 |     0.92 |
    #+TBLFM: @2$3=$1+$2;T::@3$3=$1+$2;U::@4$3=$1+$2;t

    L'introduction de valeurs de durées doit être sous la form
    '=HH:MM[:SS]=', où les secondes sont optionnelles. 

    Avec le drapeau '=T=', les durées calculées sont affichées comme
    '=HH:MM:SS=' (voir la première formule ci-dessus). Avec le drapeau
    '=U=', les secondes sont omises de sorte que le résultat est
    seulement '=HH:MM=' (voir la seconde formule ci-dessus). La mise à
    zéro du champ des heure dépend de la valeur de la variable
    =org-table-duration-hour-zero-padding=.

    Avec le drapeau '=t=', les durées calculées sont affichées selon
    la valeur de l'option =org-table-duration-custom-format=, qui par
    défaut est =hours= et affiche le résultat comme une fraction
    d'heures (voir la troisième formule dans l'exemple ci-dessus). 

    Les valeurs de durées négatives peuvent aussi bien être
    manipulées, et les entiers sont considérés comme des secondes en
    addition comme en soustraction. 

*** Les diagrammes en barre ASCII
    Lorsque le point est sur une colonne, taper =C-c `` a= ou =M-x
    orgtbl-ascii-plot= crée une nouvelle colonne contenant un
    diagramme en barre ASCII. Le diagramme est implémenté via une
    formule de colonne rectangulaire. Lorsque le source de colonne
    change, le diagramme en barre peut être mis à jour en
    rafraichissant le tableau, par exemple en tapant =C-u C-c *=.
    
    | Sede          | Max cites |              |
    |---------------+-----------+--------------|
    | Chile         |    257.72 | WWWWWWWWWWWW |
    | Leeds         |    165.77 | WWWWWWWh     |
    | Sao Paolo     |     71.00 | WWW;         |
    | Stockholm     |    134.19 | WWWWWW:      |
    | Morelia       |    257.56 | WWWWWWWWWWWW |
    | Rochefourchat |      0.00 |              |
    #+TBLFM: $3='(orgtbl-ascii-draw $2 0.0 257.72 12)

    La formule est un appel Elisp.
   
    =orgtbl-ascii-draw= valeur min max &optional width

    Dessine un diagrame en barre ASCII dans un tableau.

    VALUE est la valeur du diagramme.
    MIN est la valeur affichée comme une barre vide. MAX est la valeur
    remplissant tous les WIDTH.
    Les valeurs sources en dehors de cette plage sont affichées comme
    '=too small=' ou '=too large='. 
    WIDTH est le nombre de caractères du diagramme en barre. Par
    défaut '=12='.
